cases/hydrodynamics/I_beam-quillelehavre-v18.06/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
}

solver          sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{

    patches         (floatingObject);
    innerDistance   100;
    outerDistance   101;

    centreOfMass    (10 0.05 5.229);

    // Density of the solid
    rhoSolid        800;

    // Cuboid mass
    mass	78.218;       

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (10.184 15.216 5.162);


    report          on;
    accelerationRelaxation 0.9;

    solver
    {
        type Newmark;
    }

    constraints
    {
        fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        }
    }

}

// ************************************************************************* //
